grevaillot/svd_tools/headers/STM32F20x/otg_hs_global.h
#pragma once 

/* --- OTG_HS_GLOBAL: USB on the go high speed ---------------------- */

/** @defgroup otg_hs_global_registers USB on the go high speed Register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL OTG_HS control and status register **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL			MMIO32(OTG_HS_GLOBAL_BASE + 0x00)
/** OTG_HS_GLOBAL_OTG_HS_GOTGINT OTG_HS interrupt register **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGINT			MMIO32(OTG_HS_GLOBAL_BASE + 0x04)
/** OTG_HS_GLOBAL_OTG_HS_GAHBCFG OTG_HS AHB configuration register **/
#define OTG_HS_GLOBAL_OTG_HS_GAHBCFG			MMIO32(OTG_HS_GLOBAL_BASE + 0x08)
/** OTG_HS_GLOBAL_OTG_HS_GUSBCFG OTG_HS USB configuration register **/
#define OTG_HS_GLOBAL_OTG_HS_GUSBCFG			MMIO32(OTG_HS_GLOBAL_BASE + 0x0c)
/** OTG_HS_GLOBAL_OTG_HS_GRSTCTL OTG_HS reset register **/
#define OTG_HS_GLOBAL_OTG_HS_GRSTCTL			MMIO32(OTG_HS_GLOBAL_BASE + 0x10)
/** OTG_HS_GLOBAL_OTG_HS_GINTSTS OTG_HS core interrupt register **/
#define OTG_HS_GLOBAL_OTG_HS_GINTSTS			MMIO32(OTG_HS_GLOBAL_BASE + 0x14)
/** OTG_HS_GLOBAL_OTG_HS_GINTMSK OTG_HS interrupt mask register **/
#define OTG_HS_GLOBAL_OTG_HS_GINTMSK			MMIO32(OTG_HS_GLOBAL_BASE + 0x18)
/** OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host OTG_HS Receive status debug read register (host mode) **/
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Host			MMIO32(OTG_HS_GLOBAL_BASE + 0x1c)
/** OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Peripheral OTG_HS Receive status debug read register (peripheral mode mode) **/
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSR_Peripheral			MMIO32(OTG_HS_GLOBAL_BASE + 0x1c)
/** OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host OTG_HS status read and pop register (host mode) **/
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host			MMIO32(OTG_HS_GLOBAL_BASE + 0x20)
/** OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral OTG_HS status read and pop register (peripheral mode) **/
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral			MMIO32(OTG_HS_GLOBAL_BASE + 0x20)
/** OTG_HS_GLOBAL_OTG_HS_GRXFSIZ OTG_HS Receive FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_GRXFSIZ			MMIO32(OTG_HS_GLOBAL_BASE + 0x24)
/** OTG_HS_GLOBAL_OTG_HS_GNPTXFSIZ_Host OTG_HS nonperiodic transmit FIFO size register (host mode) **/
#define OTG_HS_GLOBAL_OTG_HS_GNPTXFSIZ_Host			MMIO32(OTG_HS_GLOBAL_BASE + 0x28)
/** OTG_HS_GLOBAL_OTG_HS_TX0FSIZ_Peripheral Endpoint 0 transmit FIFO size (peripheral mode) **/
#define OTG_HS_GLOBAL_OTG_HS_TX0FSIZ_Peripheral			MMIO32(OTG_HS_GLOBAL_BASE + 0x28)
/** OTG_HS_GLOBAL_OTG_HS_GNPTXSTS OTG_HS nonperiodic transmit FIFO/queue status register **/
#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS			MMIO32(OTG_HS_GLOBAL_BASE + 0x2c)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG OTG_HS general core configuration register **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG			MMIO32(OTG_HS_GLOBAL_BASE + 0x38)
/** OTG_HS_GLOBAL_OTG_HS_CID OTG_HS core ID register **/
#define OTG_HS_GLOBAL_OTG_HS_CID			MMIO32(OTG_HS_GLOBAL_BASE + 0x3c)
/** OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ OTG_HS Host periodic transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ			MMIO32(OTG_HS_GLOBAL_BASE + 0x100)
/** OTG_HS_GLOBAL_OTG_HS_DIEPTXF1 OTG_HS device IN endpoint transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF1			MMIO32(OTG_HS_GLOBAL_BASE + 0x104)
/** OTG_HS_GLOBAL_OTG_HS_DIEPTXF2 OTG_HS device IN endpoint transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF2			MMIO32(OTG_HS_GLOBAL_BASE + 0x108)
/** OTG_HS_GLOBAL_OTG_HS_DIEPTXF3 OTG_HS device IN endpoint transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF3			MMIO32(OTG_HS_GLOBAL_BASE + 0x11c)
/** OTG_HS_GLOBAL_OTG_HS_DIEPTXF4 OTG_HS device IN endpoint transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF4			MMIO32(OTG_HS_GLOBAL_BASE + 0x120)
/** OTG_HS_GLOBAL_OTG_HS_DIEPTXF5 OTG_HS device IN endpoint transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF5			MMIO32(OTG_HS_GLOBAL_BASE + 0x124)
/** OTG_HS_GLOBAL_OTG_HS_DIEPTXF6 OTG_HS device IN endpoint transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF6			MMIO32(OTG_HS_GLOBAL_BASE + 0x128)
/** OTG_HS_GLOBAL_OTG_HS_DIEPTXF7 OTG_HS device IN endpoint transmit FIFO size register **/
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF7			MMIO32(OTG_HS_GLOBAL_BASE + 0x12c)

/**@}*/


/** @defgroup otg_hs_global_otg_hs_gotgctl OTGHSGOTGCTL OTG_HS control and status register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_BSVLD B-session valid **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_BSVLD		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_ASVLD A-session valid **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_ASVLD		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_DBCT Long/short debounce time **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_DBCT		(1 << 17)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_CIDSTS Connector ID status **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_CIDSTS		(1 << 16)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_DHNPEN Device HNP enabled **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_DHNPEN		(1 << 11)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HSHNPEN Host set HNP enable **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HSHNPEN		(1 << 10)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HNPRQ HNP request **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HNPRQ		(1 << 9)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HNGSCS Host negotiation success **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_HNGSCS		(1 << 8)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_SRQ Session request **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_SRQ		(1 << 1)
/** OTG_HS_GLOBAL_OTG_HS_GOTGCTL_SRQSCS Session request success **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGCTL_SRQSCS		(1 << 0)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_gotgint OTGHSGOTGINT OTG_HS interrupt register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GOTGINT_DBCDNE Debounce done **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGINT_DBCDNE		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GOTGINT_ADTOCHG A-device timeout change **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGINT_ADTOCHG		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GOTGINT_HNGDET Host negotiation detected **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGINT_HNGDET		(1 << 17)
/** OTG_HS_GLOBAL_OTG_HS_GOTGINT_HNSSCHG Host negotiation success status change **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGINT_HNSSCHG		(1 << 9)
/** OTG_HS_GLOBAL_OTG_HS_GOTGINT_SRSSCHG Session request success status change **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGINT_SRSSCHG		(1 << 8)
/** OTG_HS_GLOBAL_OTG_HS_GOTGINT_SEDET Session end detected **/
#define OTG_HS_GLOBAL_OTG_HS_GOTGINT_SEDET		(1 << 2)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_gahbcfg OTGHSGAHBCFG OTG_HS AHB configuration register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GAHBCFG_PTXFELVL Periodic TxFIFO empty level **/
#define OTG_HS_GLOBAL_OTG_HS_GAHBCFG_PTXFELVL		(1 << 8)
/** OTG_HS_GLOBAL_OTG_HS_GAHBCFG_TXFELVL TxFIFO empty level **/
#define OTG_HS_GLOBAL_OTG_HS_GAHBCFG_TXFELVL		(1 << 7)
/** OTG_HS_GLOBAL_OTG_HS_GAHBCFG_DMAEN DMA enable **/
#define OTG_HS_GLOBAL_OTG_HS_GAHBCFG_DMAEN		(1 << 5)

#define OTG_HS_GLOBAL_OTG_HS_GAHBCFG_HBSTLEN_SHIFT		1
#define OTG_HS_GLOBAL_OTG_HS_GAHBCFG_HBSTLEN_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_gahbcfg_hbstlen HBSTLEN Burst length/type
@{*/
/**@}*/

/** OTG_HS_GLOBAL_OTG_HS_GAHBCFG_GINT Global interrupt mask **/
#define OTG_HS_GLOBAL_OTG_HS_GAHBCFG_GINT		(1 << 0)

/**@}*/

