grevaillot/svd_tools/headers/STM32F20x/otg_hs_global.h
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Host_CHNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_host_chnum CHNUM Channel number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxstsp_peripheral OTGHSGRXSTSPPeripheral OTG_HS status read and pop register (peripheral mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_FRMNUM_SHIFT		21
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_FRMNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_peripheral_frmnum FRMNUM Frame number
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_PKTSTS_SHIFT		17
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_PKTSTS_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_peripheral_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_DPID_SHIFT		15
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_DPID_MASK		0x03
/** @defgroup otg_hs_global_otg_hs_grxstsp_peripheral_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_BCNT_SHIFT		4
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_BCNT_MASK		0x7ff
/** @defgroup otg_hs_global_otg_hs_grxstsp_peripheral_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_EPNUM_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXSTSP_Peripheral_EPNUM_MASK		0x0f
/** @defgroup otg_hs_global_otg_hs_grxstsp_peripheral_epnum EPNUM Endpoint number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_grxfsiz OTGHSGRXFSIZ OTG_HS Receive FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GRXFSIZ_RXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_grxfsiz_rxfd RXFD RxFIFO depth
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_gnptxfsiz_host OTGHSGNPTXFSIZHost OTG_HS nonperiodic transmit FIFO size register (host mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXFSIZ_Host_NPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_GNPTXFSIZ_Host_NPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_gnptxfsiz_host_nptxfd NPTXFD Nonperiodic TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXFSIZ_Host_NPTXFSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GNPTXFSIZ_Host_NPTXFSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_gnptxfsiz_host_nptxfsa NPTXFSA Nonperiodic transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_tx0fsiz_peripheral OTGHSTX0FSIZPeripheral Endpoint 0 transmit FIFO size (peripheral mode)
@{*/


#define OTG_HS_GLOBAL_OTG_HS_TX0FSIZ_Peripheral_TX0FD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_TX0FSIZ_Peripheral_TX0FD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_tx0fsiz_peripheral_tx0fd TX0FD Endpoint 0 TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_TX0FSIZ_Peripheral_TX0FSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_TX0FSIZ_Peripheral_TX0FSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_tx0fsiz_peripheral_tx0fsa TX0FSA Endpoint 0 transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_gnptxsts OTGHSGNPTXSTS OTG_HS nonperiodic transmit FIFO/queue status register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXQTOP_SHIFT		24
#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXQTOP_MASK		0x7f
/** @defgroup otg_hs_global_otg_hs_gnptxsts_nptxqtop NPTXQTOP Top of the nonperiodic transmit request queue
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTQXSAV_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTQXSAV_MASK		0xff
/** @defgroup otg_hs_global_otg_hs_gnptxsts_nptqxsav NPTQXSAV Nonperiodic transmit request queue space available
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXFSAV_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_GNPTXSTS_NPTXFSAV_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_gnptxsts_nptxfsav NPTXFSAV Nonperiodic TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_gccfg OTGHSGCCFG OTG_HS general core configuration register
@{*/

/** OTG_HS_GLOBAL_OTG_HS_GCCFG_NOVBUSSENS VBUS sensing disable option **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_NOVBUSSENS		(1 << 21)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_SOFOUTEN SOF output enable **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_SOFOUTEN		(1 << 20)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_VBUSBSEN Enable the VBUS sensing device **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_VBUSBSEN		(1 << 19)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_VBUSASEN Enable the VBUS sensing device **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_VBUSASEN		(1 << 18)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_I2CPADEN Enable I2C bus connection for the external I2C PHY interface **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_I2CPADEN		(1 << 17)
/** OTG_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN Power down **/
#define OTG_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN		(1 << 16)

/**@}*/

/** @defgroup otg_hs_global_otg_hs_cid OTGHSCID OTG_HS core ID register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_MASK		0xffffffff
/** @defgroup otg_hs_global_otg_hs_cid_product_id PRODUCTID Product ID field
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_hptxfsiz OTGHSHPTXFSIZ OTG_HS Host periodic transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hptxfsiz_ptxfd PTXFD Host periodic TxFIFO depth
@{*/
/**@}*/


#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_SHIFT		0
#define OTG_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_hptxfsiz_ptxsa PTXSA Host periodic TxFIFO start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_global_otg_hs_dieptxf1 OTGHSDIEPTXF1 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_SHIFT		16
#define OTG_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_MASK		0xffff
/** @defgroup otg_hs_global_otg_hs_dieptxf1_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


